In [2]:
import pandas as pd 
import numpy as np
from matplotlib import pyplot as plt

In [9]:
startsalary = pd.read_excel("./StartSalary.xlsx", header=0 ,index_col="Graduate", usecols=[0,1])
startsalary.columns = startsalary.columns.str.replace(' ','_')
startsalary

          Starting_Salary
Graduate
1                    3450
2                    3550
3                    3650
4                    3480
5                    3355
6                    3310
7                    3490
8                    3730
9                    3540
10                   3925
11                   3520
12                   3480

In [11]:
salary = np.array(startsalary['Starting_Salary'])
salary

array([3450, 3550, 3650, 3480, 3355, 3310, 3490, 3730, 3540, 3925, 3520,
       3480], dtype=int64)

In [12]:
sum(salary)/len(salary)

3540.0

In [13]:
np.mean(salary)

3540.0

In [18]:
sorted_salary = np.sort(salary)
sorted_salary

array([3310, 3355, 3450, 3480, 3480, 3490, 3520, 3540, 3550, 3650, 3730,
       3925], dtype=int64)

In [20]:
n = len(sorted_salary)
if n % 2 == 0: 
    x0 = sorted_salary[n//2-1]
    x1 = sorted_salary[n//2]
    median = (x0+x1)/2
else: 
    median = sorted_salary[(n+1)//2-1]
median

3505.0

In [21]:
np.median(salary) # 중앙값

3505.0

In [23]:
pd.Series(salary).mode() #최빈값

0    3480
dtype: int64

In [24]:
np.var(salary)#분산

25154.166666666668

In [25]:
np.std(salary,ddof=0)
#표준편차 delta degrees of freedom(모집단 표준편차로 취급한것)

158.60065153291984

In [28]:
#기술 통계 수치를 한번에 보여줄수있는 함수 ######
salary_df = pd.DataFrame(salary)
salary_df.describe(include='all')

                 0
count    12.000000
mean   3540.000000
std     165.652978
min    3310.000000
25%    3472.500000
50%    3505.000000
75%    3575.000000
max    3925.000000